export interface Character {
  name: string;
  image: string;
  descriptions: Array<string>;
  birth: {
    year: number;
    month: number;
    date: number;
  };
  weapon: string;
  domicile: string;
  link: string;
}

export const roleList: Record<string, Character> = {
  "8": {
    name: "ハチワレ hachiware 小八",
    image:
      "https://chiikawa.r2.1591420.xyz/yobri/icon_hachiware-1-300x300.webp", // 替换成头像路径
    descriptions: [
      "性格外向，乐观开朗，是个乐天派，可也会因此让自己陷入危机。善解人意，台词较多，会替朋友们说出想表达的意思。会为朋友考虑，珍视友情。",
      "在紧要关头会大喊“总会有办法的！”，多次拼尽全力冲出重围。",
      "靠除草、采集和讨伐为生，已考取五级除草证。",
      "会为了想要的东西（如讨伐棍、相机）而努力存钱，过着节俭的生活。",
      "较为惜物，餐具茶杯等有明显的使用痕迹和裂纹。睡在陈旧的草席上。",
      "喜欢下厨，会做各种平民料理。经常和朋友们分享食物。爱好摄影，喜欢给朋友们拍照。",
      "有时会在河流里捕捞某种可食用的东西，但吃多了会肚子痛。",
      "虽然没有画出来，但家里有煮开水的地方，也有类似冷藏库、可以拿来冰牛奶的空间。",
      "虽然角色原型是猫咪，但可以食用洋葱和巧克力，并不等同现实中自然界的猫咪。",
      "作者曾经考虑为其取名为“池谷”（音：Ikeya，同家居品牌宜家）。",
    ],

    birth: {
      year: 2020,
      month: 7,
      date: 29,
    },

    weapon: "蓝色的讨伐棍",
    domicile: "住在一个没有门、可以看见月亮的山洞里，有时会有可怕的家伙入侵。",
    link: "/images/8",
  },
  "71": {
    name: "ちいかわ chiikawa 吉伊",
    image: "https://chiikawa.r2.1591420.xyz/yobri/icon_chiikawa-1-300x300.webp", // 替换成头像路径
    descriptions: [
      "《吉伊卡哇》系列中的主要角色之一。身体小小的，毛发是白色，尾巴是小小的圆球。天气变冷时毛发会变长，不修剪的话会长痱子。",
      "虽然有点爱哭鬼，但内心很善良。性格内向和害羞，行事胆小慎重，但会在一些关键时刻机敏灵活化险为夷。",
      "心思细腻，会为朋友考虑，珍视友情。在重要的朋友遭遇危险时，会爆发出十足的勇气。",
      "靠除草、采集和讨伐为生，正在努力备考五级除草证。",
      "独处时，会在开心的时候唱歌。",
      "睡觉时会抱着棕色小熊玩偶。",
      "兴趣是抽奖。运气很好，经常在各种抽奖活动中中奖。居住的房子也是在“超级可口优格”抽奖活动中获得的。",
      "虽然没有画出来，但家里是有厨房和厕所的。",
      "角色原型可能参照了鼠总科动物，官方Twitter曾用🐁emoji代表该角色。",
      "作者曾经考虑为其取名为“似鸟”（音：Nitori，同家居品牌宜得利）。",
      "现实中有十分类似吉伊居住地的建筑群，如和歌山的ToreTore度假村[3]、熊本的阿苏农场度假村和福岛的天使森林那须白河度假村。",
    ],

    birth: {
      year: 2017,
      month: 5,
      date: 1,
    },

    weapon: "粉色的讨伐棍",
    domicile: "白色的圆顶房子，有门窗，位于形似住宅社区的地方。",
    link: "/images/71",
  },
  "537": {
    name: "うさぎ usagi 乌萨奇",
    image: "https://chiikawa.r2.1591420.xyz/yobri/icon_usagi-1-300x300.webp", // 替换成头像路径
    descriptions: [
      "《吉伊卡哇》系列中的主要角色之一。是吉伊和小八的好朋友，以兔子为原型。身体小小的，身体的毛发是黄色，尾巴为白色的大绒球。",
      "靠除草、采集和讨伐为生，已考取三级除草证。",
      "性格活泼，精力充沛，无所畏惧，面对困难会想出很多点子。",
      "看似大条和无所谓，但会在乎朋友们。乐于和朋友们分享食物，在朋友遇到困难时陪伴和保护对方，对抗敌人。",
      "会发出各种奇特的叫声来表达和沟通，如“乌拉”“呀哈”等，情绪高涨地跑来跑去。行为难以预测，经常有出其不意的举动。",
      "战斗力较强，在紧要关头能带领同伴们扭转局势。",
      "经常在二手店购入奇怪的道具。有时会拿来可疑的物品，也有因此受到诅咒的时候。",
      "弹吉他的技艺高超。在地下洞穴里的酒吧当过DJ，用树叶摩擦橡子发出音乐声。",
      "私生活充满谜团。",
      "双耳似乎较为有力，不仅能戳破连帽雨衣的帽子，在废稿中还曾经用双耳支撑身体倒立。",
      "作者曾经考虑为其取名为“钝器”（音：Donki，同百货商店品牌唐吉诃德）。",
    ],

    birth: {
      year: 2019,
      month: 1,
      date: 22,
    },

    weapon: "中间黄色两端白色的棍棒，一端有兔兔的涂鸦，两头可以发射火药",
    domicile: "未知",
    link: "/images/537",
  },
};
